{"Name":"MultiOperationHelper","DisplayName":"批量操作","GameVersion":1.0,"Version":4.1,"Desc":"[作者]\r\n    枫轩\r\n[简介]\r\n批量操作\nBy：枫轩\n\n已适配正式版本。主要功能：乾坤界内批量操作、批量画符、多人食用(吞噬)、多人装备、批量放置、批量炼宝、批量施展神通、全选等。\n\n一、选中物品时会添加按键【批量操作】，可以打开操作菜单；在乾坤界中按住左Ctrl，鼠标右键点击物品，也可以打开操作菜单（乾坤界内物品数量为0时不会弹出菜单）；操作菜单包括：批量画符、多人食用、多人装备、批量放置。\n\n1、【批量画符】：选择小人去绘制多种不同的符咒，使用的符纸与选中的符纸同品阶同名称（不使用禁用的符纸），不管堆叠数量均可用。使用快速画符的品质，若无符咒品质数据，则为100品质。\n\n2、【多人食用(吞噬)】和【批量吞噬】：让单个或多个小人食用（吞噬）与选中的物品同品阶同名称的物品，不食用禁用的物品，不管堆叠数量均可用，并可设置重复食用次数。\n\n3、【多人装备】：让单个或多个小人装备与选中物品同品阶同材料的物品（不装备禁用的物品），不适用于法宝和秘籍，其他物品不管堆叠数量均可用。\n\n4、【批量放置】：将与选中物品同品阶的物品放置到单个或多个置物台上，不管堆叠数量均可用。\n\n5、乾坤界内外物品的操作功能完全相同，批量操作物品时，会优先使用乾坤界外的物品，再自动从乾坤界取出补足数量，会排除禁用的物品、镇物、元神寄托物品、通灵物品。\n\n二、选中小人时会添加按键【批量操作】，可以打开操作菜单，操作菜单包括：批量炼宝、各种已学会的神通。\n\n1、【批量炼宝】：按住左Shift键，鼠标左键点选物品，物品会添加到面板上；若物品的堆叠数>1，则可以设置个数。添加任务后按键会变成【取消批量炼宝】，鼠标悬停可查看剩余任务数量，点击可取消剩余任务，正在进行的炼宝不被取消。若小人灵气不足则会等到灵气满足时自动继续炼宝，鼠标悬停在按键上会提示灵气不足。为了防止出现问题，有时某些选中的物品可能会被忽略。\n\n2、可批量施展神通，包括：搜魂、幽淬之法、道淬之法、他化自在、魂体寄生、化伤术、再造术、大衍神算、鉴定、御木诀、天霖诀、万木回春、吸星掌、凝珀诀、天妖化血术、鼎炉吸真术、元央归息法、风月幻境、如意幻境、摄神御鬼、九幽炼神、献祭。\n搜魂、幽淬、鉴定、御木诀、天霖诀、万木回春、吸星掌、凝珀诀、天妖化血术、鼎炉吸真术、元央归息法、风月幻境、如意幻境、摄神御鬼、九幽炼神、献祭等用法相同，按住左shift键，鼠标左键点选物品/小人/植物，物品/小人/植物的名称会添加到面板上（如果目标已被其他操作锁定则无法选中），确定以施展神通。\n对于幽淬，若物品的堆叠数=1，则可以设置幽淬的次数；若物品的堆叠数>1，则可以设置幽淬的个数。可选中并批量幽淬12阶物品，但不会产生任何效果。\n\n三、其他功能，包括：全选、打断娱乐。\n\n1、在选择小人的界面，可以通过快捷键“左Ctrl+A”实现全选，例如本mod中的多人食用、多人装备、批量他化等和原游戏中的历练、驻扎、进入地图等。\n\n2、点击小人或成功添加命令后会打断小人的娱乐状态。\n\n准确说是批量添加命令，画符还是一张一张画，神通还是一个一个施展，只是不用一次一次的手动操作。\n本mod不修改画符品质和幽淬的概率，可兼容其他修改画符品质和幽淬概率的mod。所有功能仅在本门派地图中有效。\n\n好用的话请点赞哦。\n\nMultiple Operation\n\nIt is available in English.\n\nMain features: Multiple Operation on the Mini Universe, Multiple Draw, Multiple Eat(Devour), Multiple Equip, Multiple Place, Multiple Craft, Multiple Perform Miracle, Select All Characters.\n\n1. Click [Multiple Operation] on the item menu to open the operation menu. On the Mini Universe panel, hold down the left Ctrl key and right-click the item to open the operation menu. The operation menu include: Multiple Draw, Multiple Eat(Devour), Multiple Equip, Multiple Place.\n\n1-1. [Multiple Draw]: Select a character to draw different talismans. Talisman papers used is of the same tier and name as the selected paper (not using banned papers). The quality of talismans is equal to the quality of Instant Draw or 100% if quality data is not available.\n\n1-2. [Multiple Eat(Devour)]: Select single or multiple characters to eat(devour) items with the same tier and name as the selected item. You can set the number of items for eating.\n\n1-3. [Multiple Equip]: Select single or multiple characters to equip items with the same tier and name as the selected item. Not applicable to artifact or manuals.\n\n1-4. [Multiple Place]: Select single or multiple Display to place items with the same tier and name as the selected item.\n\n1-5. Items outside the Mini Universe will be used first and then automatically taken from the Mini Universe to replenish the quantity. Not using banned items, Relics, Spirit Items, Illuminated Items.\n\n2. Click [Multiple Operation] on the character menu to open the operation menu. The operation menu include: Multiple Craft, Miracles learned.\n\n2-1. [Multiple Craft]: Click to open the Multiple Craft panel. Hold down the left Shift key and left-click items to add them to the Multiple Craft panel. If the number of stacks of the item is greater than 1, you can set the number of the item. It will be replaced with [Cancel Multiple Craft] after the order is given. If the character's Qi is insufficient, it will wait until the Qi is satisfied and then continue to craft artifacts automatically.\n\n2-2. Miracles that can be multiple performed include: Soul Inquiry, Specter Refinement, Tao Refinement, Exploitation of External Pleasures, Soul Infection, Panacea, Reconstruction, Derivative Calculation, Feng Shui Identifying, Chant of Wood Mastery, Rainchant, Botanic Revitalization, Palm of Absorption, Soul Chant, Sanguine Absorption, Qi Absorption Cauldron, Alleviation of Singularity, Alluring Illusion, Illusory Realm, Soul Snatcher, Nether Spirit Forging, Sacrifice Offering.\n\n3. On the select characters panel, you can use the hotkey (left Ctrl + A) to select all characters.","Author":"枫轩","UIPackage":"UI/MultiOperationHelper","ID":"1866576765","Flag":-291584612,"Tags":["Function","Usability","ExcludeRealmsHeaven"],"IncreasedDesc":"V4.10 增加批量神通：道淬之法\n\n","IsInsideCreat":false,"Previews":["01.png","02.png","03.png","04.png","05.png","06.png","07.png"],"ParentModInfo":null}